{"schema_version":"1.7.3","id":"DRUPAL-CONTRIB-2025-003","published":"2025-01-15T15:58:05Z","modified":"2025-12-10T23:41:13.197343Z","aliases":["CVE-2025-31677","GHSA-9w85-x5hg-fr66"],"details":"The Drupal AI module provides a framework for easily integrating Artificial Intelligence on any Drupal site using any kind of AI (from multiple vendors). The sub-modules AI Chatbot and AI Assistants API allow users to interact with the Drupal site via a 'chat' interface.\n\nThe AI Chatbot module doesn't protect against Cross Site Request Forgeries in the Deepchat chatbot. This could allow an attacker to craft a scenario that can forge a request on behalf of a privileged user. When combined with the AI Search submodule, this could result in the AI Assistant exposing indexed data that the attacker should not have access to. When combined with the external AI Agent module, this could result in the AI Assistant exposing and allowing modification of site configuration of fields, content types, and vocabularies. Sites with custom built agents, with more privileged access, could be at greater risk from an exploit of this vulnerability.\n\nThis vulnerability is mitigated by:\n\n* The targeted user needs to have an active session with a role with the \"access deepchat api\" permission and permission to assistants.\n* To extract data, the target site must have a permissive CORS policy allowing the attacking site to read the result of a cross origin request.\n* To modify data, the targeted user must have permission to use the configured agents.","affected":[{"package":{"name":"drupal/ai","ecosystem":"Packagist:https://packages.drupal.org/8","purl":"pkg:composer/drupal/ai"},"ranges":[{"type":"ECOSYSTEM","events":[{"introduced":"1.0.0"},{"fixed":"1.0.2"}],"database_specific":{"constraint":">=1.0.0 <1.0.2"}}],"database_specific":{"affected_versions":">=1.0.0 <1.0.2","patched":true,"source":"https://github.com/DrupalSecurityTeam/drupal-advisory-database/blob/main/advisories/ai/DRUPAL-CONTRIB-2025-003.json"}}],"references":[{"type":"WEB","url":"https://www.drupal.org/sa-contrib-2025-003"}],"credits":[{"name":"Marcus Johansson","contact":["https://www.drupal.org/user/385947"]}]}